app/controllers/drivers_controller.rb

  def index
    @drivers = Driver.all
---
SELECT "drivers".* FROM "drivers"

  def create
    @driver = Driver.new(driver_params)
    if @driver.save
---
INSERT INTO "drivers" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "failed "], ["last_name", "failed "], ["created_at", "2021-04-09 22:22:38.389713"], ["updated_at", "2021-04-09 22:22:38.389713"]]

  def destroy
    @driver = Driver.find(params[:id])
---
SELECT "drivers".* FROM "drivers" WHERE "drivers"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]